# 15diag.py
import numpy as np

a = np.eye(6,6) #왼쪽대각 1숫자표시 + 나머지 0
print(a)
print()

b = np.diag( [7,9,3,4,5,2] )
print(b)
print()
'''
[[7 0 0 0 0 0]
 [0 9 0 0 0 0]
 [0 0 3 0 0 0]
 [0 0 0 4 0 0]
 [0 0 0 0 5 0]
 [0 0 0 0 0 2]]
'''


c = np.full( (6,6), 31) # 6행 * 6열
print(c)
print()

# 6행 * 6열
x = np.array([
    [1,2,3,4,5,6],
    [6,5,4,3,2,1],
    [11,12,13,14,15,16],
    [76,75,74,73,72,71],
    [86,85,84,83,82,81],
    [96,95,94,93,92,91]
  ])
print(x)
print()
print('대각선데이터추출  ' , np.diag(x))
print()
# [ 1  5 13 73 82 91]
y = np.diag( [ 1,  5, 13, 73, 82, 91])
print()
print(y)
# b = np.diag( [7,9,3,4,5,2] )